# Introduction to Pandas

Civil 774 - Smart Infrastructure Analytics

![alt text](https://miro.medium.com/max/3006/1*KdxlBR9P3mDp9JZ_URMdYQ.jpeg)



**pandas** is a Python package providing fast, flexible, and expressive data structures designed to work with *relational* or *labeled* data both. It is a fundamental high-level building block for doing practical, real world data analysis in Python. 

pandas is well suited for:

- Tabular data with heterogeneously-typed columns, as in an SQL table or Excel spreadsheet
- Ordered and unordered (not necessarily fixed-frequency) time series data.
- Arbitrary matrix data (homogeneously typed or heterogeneous) with row and column labels
- Any other form of observational / statistical data sets. The data actually need not be labeled at all to be placed into a pandas data structure


Key features:
    
- Easy handling of **missing data**
- **Size mutability**: columns can be inserted and deleted from DataFrame and higher dimensional objects
- Automatic and explicit **data alignment**: objects can be explicitly aligned to a set of labels, or the data can be aligned automatically
- Powerful, flexible **group by functionality** to perform split-apply-combine operations on data sets
- Intelligent label-based **slicing, fancy indexing, and subsetting** of large data sets
- Intuitive **merging and joining** data sets
- Flexible **reshaping and pivoting** of data sets
- **Hierarchical labeling** of axes
- Robust **IO tools** for loading data from flat files, Excel files, databases, and HDF5
- **Time series functionality**: date range generation and frequency conversion, moving window statistics, moving window linear regressions, date shifting and lagging, etc.

In this lecture, we will talk about: 
1. Pandas Data Structures
2. Import data into Pandas
3. Pandas fundamentals

In [1]:
import pandas as pd

## 1. Pandas Data Structures

## Series

A **Series** is a single vector of data (like an array) with an *index* that labels each element in the vector.

Now first let's create a Pandas series with only numbers

In [2]:
counts = pd.Series([23,2321,42,52])

In [3]:
counts

0      23
1    2321
2      42
3      52
dtype: int64

If an index is not specified, a default sequence of integers is assigned as the index. A NumPy array comprises the values of the `Series`, while the index is a pandas `Index` object.

Let's try to see only the values of a series

In [7]:
counts.values

array([  23, 2321,   42,   52])

Now let's try to see only the indexes of a series

In [8]:
counts.index

RangeIndex(start=0, stop=4, step=1)

### Index and slicing

The indexes can be strings as well, so they can be more meaningful
Now let's try that:

In [10]:
Price = pd.Series([1.2, 0.8, 1.1, 0.6], index=['Auckland','Christchurch','Wellington', 'Hamilton'])

In [11]:
Price

Auckland        1.2
Christchurch    0.8
Wellington      1.1
Hamilton        0.6
dtype: float64

In [12]:
Price.index

Index(['Auckland', 'Christchurch', 'Wellington', 'Hamilton'], dtype='object')

In [13]:
Price.values

array([1.2, 0.8, 1.1, 0.6])

These labels can be used to refer to the values in the `Series`.

In [14]:
Price['Auckland']

1.2

With the string indexes, we can easily find values using the index. For instance, let's try to find the index name end with letter "d"

In [15]:
Price[[a.endswith('d') for a in Price.index]]

Auckland    1.2
dtype: float64

We can still use positional indexing if we wish. Let's try to find the first second city in our series

In [20]:
Price[1]

0.8

Slicing is the way we can take some data out of the series, and later on Dataframe, we talked briefly about this in the previous week but let's do it in Pandas

In [23]:
Price[1:3]

Christchurch    0.8
Wellington      1.1
dtype: float64

Let's also see if we can add new data into this series. In pandas we can use the `.append` for this purpose. However, note that .append is not an in-place operation in Pandas. From the docs:

    'Append rows of other to the end of this frame, returning a new object. Columns not in this frame are added as new columns.'

We need to assign the result back.

In [24]:
new_series = pd.Series([0.9],index=['Gisborne'])

In [25]:
Price=Price.append(new_series)

In [26]:
Price

Auckland        1.2
Christchurch    0.8
Wellington      1.1
Hamilton        0.6
Gisborne        0.9
dtype: float64

and also drop or remove some values. Let's try to remove the last item that had been added

In [27]:
Price = Price.drop('Gisborne')

In [28]:
Price

Auckland        1.2
Christchurch    0.8
Wellington      1.1
Hamilton        0.6
dtype: float64

### Convert Python array to Pandas Series

With Series contain values and indexes separately, we can convert a standard Python array into a Pandas series and provide new indexes
 Let's try that:

In [29]:
array0 = [123,2312,442,3322]

In [30]:
pop = pd.Series(array0)
pop

0     123
1    2312
2     442
3    3322
dtype: int64

In [32]:
pop.index = ['Auckland','Christchurch','Wellington', 'Hamilton']

In [33]:
pop

Auckland         123
Christchurch    2312
Wellington       442
Hamilton        3322
dtype: int64

We can also combine with other packages in Python, e.g. Numpy, to create series in Pandas, for instance, let's use another data analytics package `Numpy` to randomly create a Series

In [34]:
import numpy as np

In [35]:
n0 = np.random.randn(4)
n0

array([-3.50841686,  0.50026537,  0.44350205,  0.34304265])

In [36]:
index0 = ['Auckland','Christchurch','Wellington', 'Hamilton']

In [37]:
s = pd.Series(n0,index=index0)
s

Auckland       -3.508417
Christchurch    0.500265
Wellington      0.443502
Hamilton        0.343043
dtype: float64

### Name the data and the index

We can give both the array of values and the index meaningful labels themselves:

In [38]:
pop.name = 'Population'
pop.index.name = 'Cities'
pop

Cities
Auckland         123
Christchurch    2312
Wellington       442
Hamilton        3322
Name: Population, dtype: int64

### Filter the data

Now let's try to filter cities with more than 350,000 people

In [39]:
pop[pop>350]

Cities
Christchurch    2312
Wellington       442
Hamilton        3322
Name: Population, dtype: int64

In [40]:
pop[pop<1000]

Cities
Auckland      123
Wellington    442
Name: Population, dtype: int64

## DataFrame

Inevitably, we want to be able to store, view and manipulate data that is *multivariate*, where for every index there are multiple fields or columns of data, often of varying data type.

A `DataFrame` is a tabular data structure, encapsulating multiple series like columns in a spreadsheet. Data are stored internally as a 2-dimensional object, but the `DataFrame` allows us to represent and manipulate higher-dimensional data.

### Create DataFrame

We created some Series in the previous section, let's combine them as a new DataFrame (2-dimension Excel-spreadsheet-like data structure!)

In [43]:
df = pd.concat([Price,pop,s],axis=1)
df

                0  Population         1
Cities
Auckland      1.2         123 -3.508417
Christchurch  0.8        2312  0.500265
Wellington    1.1         442  0.443502
Hamilton      0.6        3322  0.343043

Notice the `DataFrame` is sorted by column name. We can change the order by indexing them in the order we desire:

In [45]:
df.columns = ['Price','Population','Score']

In [46]:
df

              Price  Population     Score
Cities
Auckland        1.2         123 -3.508417
Christchurch    0.8        2312  0.500265
Wellington      1.1         442  0.443502
Hamilton        0.6        3322  0.343043

And we can also rearrange the order of these columns

In [47]:
df[['Population','Price','Score']]

              Population  Price     Score
Cities
Auckland             123    1.2 -3.508417
Christchurch        2312    0.8  0.500265
Wellington           442    1.1  0.443502
Hamilton            3322    0.6  0.343043

A `DataFrame` has a second index, representing the columns:

In [48]:
df.columns

Index(['Price', 'Population', 'Score'], dtype='object')

If we wish to access columns, we can do so either by dict-like indexing or by attribute:

In [49]:
df['Price']

Cities
Auckland        1.2
Christchurch    0.8
Wellington      1.1
Hamilton        0.6
Name: Price, dtype: float64

In [50]:
df['Score']

Cities
Auckland       -3.508417
Christchurch    0.500265
Wellington      0.443502
Hamilton        0.343043
Name: Score, dtype: float64

In [51]:
df.Price

Cities
Auckland        1.2
Christchurch    0.8
Wellington      1.1
Hamilton        0.6
Name: Price, dtype: float64

We can modify or add value to a Dataframe. Locate the index of a certain value by using `.loc` (if we have a string or mixed index), or `.iloc` if we use a numberic index.

In [54]:
df.loc['Auckland','Population'] = 1600
df

              Price  Population     Score
Cities
Auckland        1.2        1600 -3.508417
Christchurch    0.8        2312  0.500265
Wellington      1.1         442  0.443502
Hamilton        0.6        3322  0.343043

In [56]:
df.iloc[0,0]

1.2

An important method to select data in `Pandas` is `.loc` and `.iloc`

They enable us to access a group of rows and columns by label(s) or a boolean array.

`.loc[]` is primarily label based, but may also be used with a boolean array.

Allowed inputs are:

* A single label, e.g. 5 or 'a', (note that 5 is interpreted as a label of the index, and never as an integer position along the index).

* A list or array of labels, e.g. ['a', 'b', 'c'].

* A slice object with labels, e.g. 'a':'f'.

* A boolean array of the same length as the axis being sliced, e.g. [True, False, True].

`.iloc[]` is primarily integer position based (from 0 to length-1 of the axis), but may also be used with a boolean array.

Allowed inputs are:

* An integer, e.g. 5.

* A list or array of integers, e.g. [4, 3, 0].

* A slice object with ints, e.g. 1:7.

* A boolean array.

Note that we can just define a new column for the dataframe `df`to add a new column, but it either need to be the same length as the `DataFrame`, or should be just one similar value for the whole column

Similar to the previously when we worked with Series, we can also use `.drop` to remove columns or rows in Pandas

**Exercise**: How can you remove a row in Pandas?

## 2. Importing data to Pandas

A key, but often under-appreciated, step in data analysis is importing the data that we wish to analyze. Pandas provides a convenient set of functions for importing tabular data in a number of formats directly into a `DataFrame` object. These functions include a slew of options to perform type inference, indexing, parsing, iterating and cleaning automatically as data are imported.

Data from text files such as CSV can be read into a DataFrame using `read_csv`:

In [58]:
df = pd.read_csv("../Data/NZ_cars.csv")
df

,OBJECTID,BASIC_COLOUR,BODY_TYPE,CC_RATING,FIRST_NZ_REGISTRATION_YEAR,FIRST_NZ_REGISTRATION_MONTH,GROSS_VEHICLE_MASS,IMPORT_STATUS,INDUSTRY_CLASS,MAKE,...,NZ_ASSEMBLED,ORIGINAL_COUNTRY,POWER_RATING,PREVIOUS_COUNTRY,SUBMODEL,TLA,TRANSMISSION_TYPE,VEHICLE_TYPE,VEHICLE_USAGE,VEHICLE_YEAR
0,3001,WHITE,SALOON,1971,1979,5,0,NEW,PRIVATE,PEUGEOT,...,UNKNOWN,NOT KNOWN,0,NONE,NaN,AUCKLAND,NaN,PASSENGER CAR/VAN,PRIVATE PASSENGER,1979
1,3002,GOLD,HATCHBACK,1769,2005,5,1245,NEW,PRIVATE,NISSAN,...,IMPORTED BUILT-UP,UNITED KINGDOM,92,NONE,1.8 HATCH AUTO,AUCKLAND,5-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2005
2,3003,RED,SALOON,5665,2005,9,2129,NEW,PRIVATE,HOLDEN,...,IMPORTED BUILT-UP,AUSTRALIA,245,NONE,S V8 AUTO,AUCKLAND,4-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2005
3,3004,BLUE,HATCHBACK,1796,2003,10,1690,NEW,PRIVATE,HOLDEN,...,IMPORTED BUILT-UP,GERMANY,85,NONE,CD HATCH 1.8L AUTO,AUCKLAND,4-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2003
4,3005,SILVER,HATCHBACK,1796,2003,6,1640,NEW,PRIVATE,HOLDEN,...,IMPORTED BUILT-UP,GERMANY,85,NONE,CITY HATCH 1.8L MAN,AUCKLAND,5-GEAR MANUAL,PASSENGER CAR/VAN,PRIVATE PASSENGER,2003
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
995,3996,SILVER,SALOON,3828,2007,3,0,NEW,PRIVATE,MITSUBISHI,...,IMPORTED BUILT-UP,AUSTRALIA,175,NONE,3.8P SEDAN A,WHANGAREI DISTRICT,5-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2007
996,3997,YELLOW,SALOON,995,1982,6,0,NEW,PRIVATE,LEYLAND,...,UNKNOWN,NOT KNOWN,0,NONE,NaN,WAIKATO DISTRICT,NaN,PASSENGER CAR/VAN,PRIVATE PASSENGER,1982
997,3998,BLUE,SALOON,2000,1991,7,0,NEW,PRIVATE,FORD,...,UNKNOWN,JAPAN,0,NONE,NaN,WHAKATANE DISTRICT,NaN,PASSENGER CAR/VAN,PRIVATE PASSENGER,1991
998,3999,BLACK,STATION WAGON,2261,2007,6,1862,NEW,PRIVATE,MAZDA,...,IMPORTED BUILT-UP,JAPAN,122,NONE,WAGON GSX 2.3 5 AUTO,NEW PLYMOUTH DISTRICT,5-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2007
999,4000,SILVER,STATION WAGON,1990,2005,12,1645,USED,PRIVATE,MAZDA,...,IMPORTED BUILT-UP,JAPAN,0,JAPAN,NaN,AUCKLAND,NaN,PASSENGER CAR/VAN,PRIVATE PASSENGER,2002

Notice that `read_csv` automatically considered the first row in the file to be a header row.

We can see the data types of the data by using `.dtypes`

If we want to see the first 5 lines in the data, `pandas` has the function `.head()` to do that

In [60]:
df.head()

,OBJECTID,BASIC_COLOUR,BODY_TYPE,CC_RATING,FIRST_NZ_REGISTRATION_YEAR,FIRST_NZ_REGISTRATION_MONTH,GROSS_VEHICLE_MASS,IMPORT_STATUS,INDUSTRY_CLASS,MAKE,...,NZ_ASSEMBLED,ORIGINAL_COUNTRY,POWER_RATING,PREVIOUS_COUNTRY,SUBMODEL,TLA,TRANSMISSION_TYPE,VEHICLE_TYPE,VEHICLE_USAGE,VEHICLE_YEAR
0,3001,WHITE,SALOON,1971,1979,5,0,NEW,PRIVATE,PEUGEOT,...,UNKNOWN,NOT KNOWN,0,NONE,NaN,AUCKLAND,NaN,PASSENGER CAR/VAN,PRIVATE PASSENGER,1979
1,3002,GOLD,HATCHBACK,1769,2005,5,1245,NEW,PRIVATE,NISSAN,...,IMPORTED BUILT-UP,UNITED KINGDOM,92,NONE,1.8 HATCH AUTO,AUCKLAND,5-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2005
2,3003,RED,SALOON,5665,2005,9,2129,NEW,PRIVATE,HOLDEN,...,IMPORTED BUILT-UP,AUSTRALIA,245,NONE,S V8 AUTO,AUCKLAND,4-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2005
3,3004,BLUE,HATCHBACK,1796,2003,10,1690,NEW,PRIVATE,HOLDEN,...,IMPORTED BUILT-UP,GERMANY,85,NONE,CD HATCH 1.8L AUTO,AUCKLAND,4-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2003
4,3005,SILVER,HATCHBACK,1796,2003,6,1640,NEW,PRIVATE,HOLDEN,...,IMPORTED BUILT-UP,GERMANY,85,NONE,CITY HATCH 1.8L MAN,AUCKLAND,5-GEAR MANUAL,PASSENGER CAR/VAN,PRIVATE PASSENGER,2003

We can change the number of lines `.head()` displays by adding a number into it. For example here we show 10 first lines

In [62]:
df.head(2)

,OBJECTID,BASIC_COLOUR,BODY_TYPE,CC_RATING,FIRST_NZ_REGISTRATION_YEAR,FIRST_NZ_REGISTRATION_MONTH,GROSS_VEHICLE_MASS,IMPORT_STATUS,INDUSTRY_CLASS,MAKE,...,NZ_ASSEMBLED,ORIGINAL_COUNTRY,POWER_RATING,PREVIOUS_COUNTRY,SUBMODEL,TLA,TRANSMISSION_TYPE,VEHICLE_TYPE,VEHICLE_USAGE,VEHICLE_YEAR
0,3001,WHITE,SALOON,1971,1979,5,0,NEW,PRIVATE,PEUGEOT,...,UNKNOWN,NOT KNOWN,0,NONE,NaN,AUCKLAND,NaN,PASSENGER CAR/VAN,PRIVATE PASSENGER,1979
1,3002,GOLD,HATCHBACK,1769,2005,5,1245,NEW,PRIVATE,NISSAN,...,IMPORTED BUILT-UP,UNITED KINGDOM,92,NONE,1.8 HATCH AUTO,AUCKLAND,5-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2005

We can also show the last X lines by `.tail(X)`, for instance the last 5 lines

In [64]:
df.tail(3)

,OBJECTID,BASIC_COLOUR,BODY_TYPE,CC_RATING,FIRST_NZ_REGISTRATION_YEAR,FIRST_NZ_REGISTRATION_MONTH,GROSS_VEHICLE_MASS,IMPORT_STATUS,INDUSTRY_CLASS,MAKE,...,NZ_ASSEMBLED,ORIGINAL_COUNTRY,POWER_RATING,PREVIOUS_COUNTRY,SUBMODEL,TLA,TRANSMISSION_TYPE,VEHICLE_TYPE,VEHICLE_USAGE,VEHICLE_YEAR
997,3998,BLUE,SALOON,2000,1991,7,0,NEW,PRIVATE,FORD,...,UNKNOWN,JAPAN,0,NONE,NaN,WHAKATANE DISTRICT,NaN,PASSENGER CAR/VAN,PRIVATE PASSENGER,1991
998,3999,BLACK,STATION WAGON,2261,2007,6,1862,NEW,PRIVATE,MAZDA,...,IMPORTED BUILT-UP,JAPAN,122,NONE,WAGON GSX 2.3 5 AUTO,NEW PLYMOUTH DISTRICT,5-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2007
999,4000,SILVER,STATION WAGON,1990,2005,12,1645,USED,PRIVATE,MAZDA,...,IMPORTED BUILT-UP,JAPAN,0,JAPAN,NaN,AUCKLAND,NaN,PASSENGER CAR/VAN,PRIVATE PASSENGER,2002

We can show only one column, for instance let's show only the `BASIC_COLOUR`

In [65]:
df['BASIC_COLOUR']

0       WHITE
1        GOLD
2         RED
3        BLUE
4      SILVER
        ...
995    SILVER
996    YELLOW
997      BLUE
998     BLACK
999    SILVER
Name: BASIC_COLOUR, Length: 1000, dtype: object

We can count the number of unique colours by using `nunique`

In [67]:
df.BASIC_COLOUR.unique()

array(['WHITE', 'GOLD', 'RED', 'BLUE', 'SILVER', 'BLACK', 'GREY',
       'YELLOW', 'GREEN', 'CREAM', 'BROWN', 'ORANGE', 'PURPLE', 'PINK'],
      dtype=object)

In [68]:
df.BASIC_COLOUR.nunique()

14

And find out the most popular colour by `value_counts()`

In [69]:
df.BASIC_COLOUR.value_counts()

SILVER    231
WHITE     195
BLUE      163
RED        96
GREY       92
BLACK      77
GREEN      67
GOLD       36
YELLOW     15
BROWN      14
CREAM       5
ORANGE      5
PURPLE      3
PINK        1
Name: BASIC_COLOUR, dtype: int64

`read_csv` is just a convenience function for `read_table`, since csv is such a common format:

In [70]:
df = pd.read_table("../Data/NZ_cars.csv", sep=',')
df.head(3)

,OBJECTID,BASIC_COLOUR,BODY_TYPE,CC_RATING,FIRST_NZ_REGISTRATION_YEAR,FIRST_NZ_REGISTRATION_MONTH,GROSS_VEHICLE_MASS,IMPORT_STATUS,INDUSTRY_CLASS,MAKE,...,NZ_ASSEMBLED,ORIGINAL_COUNTRY,POWER_RATING,PREVIOUS_COUNTRY,SUBMODEL,TLA,TRANSMISSION_TYPE,VEHICLE_TYPE,VEHICLE_USAGE,VEHICLE_YEAR
0,3001,WHITE,SALOON,1971,1979,5,0,NEW,PRIVATE,PEUGEOT,...,UNKNOWN,NOT KNOWN,0,NONE,NaN,AUCKLAND,NaN,PASSENGER CAR/VAN,PRIVATE PASSENGER,1979
1,3002,GOLD,HATCHBACK,1769,2005,5,1245,NEW,PRIVATE,NISSAN,...,IMPORTED BUILT-UP,UNITED KINGDOM,92,NONE,1.8 HATCH AUTO,AUCKLAND,5-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2005
2,3003,RED,SALOON,5665,2005,9,2129,NEW,PRIVATE,HOLDEN,...,IMPORTED BUILT-UP,AUSTRALIA,245,NONE,S V8 AUTO,AUCKLAND,4-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2005

The `sep` argument can be customized as needed to accomodate arbitrary separators. For example, we can use a regular expression to define a variable amount of whitespace, which is unfortunately very common in some data formats: 
    
    sep='\s+'

For a more useful index, we can specify the first two columns as the indexes of our data, which together provide a unique index to the data.

In [71]:
df = pd.read_csv("../Data/NZ_cars.csv", index_col = ['OBJECTID'])
df.head(3)

,BASIC_COLOUR,BODY_TYPE,CC_RATING,FIRST_NZ_REGISTRATION_YEAR,FIRST_NZ_REGISTRATION_MONTH,GROSS_VEHICLE_MASS,IMPORT_STATUS,INDUSTRY_CLASS,MAKE,MODEL,...,NZ_ASSEMBLED,ORIGINAL_COUNTRY,POWER_RATING,PREVIOUS_COUNTRY,SUBMODEL,TLA,TRANSMISSION_TYPE,VEHICLE_TYPE,VEHICLE_USAGE,VEHICLE_YEAR
OBJECTID,,,,,,,,,,,,,,,,,,,,,
3001,WHITE,SALOON,1971,1979,5,0,NEW,PRIVATE,PEUGEOT,504,...,UNKNOWN,NOT KNOWN,0,NONE,NaN,AUCKLAND,NaN,PASSENGER CAR/VAN,PRIVATE PASSENGER,1979
3002,GOLD,HATCHBACK,1769,2005,5,1245,NEW,PRIVATE,NISSAN,PULSAR,...,IMPORTED BUILT-UP,UNITED KINGDOM,92,NONE,1.8 HATCH AUTO,AUCKLAND,5-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2005
3003,RED,SALOON,5665,2005,9,2129,NEW,PRIVATE,HOLDEN,COMMODORE,...,IMPORTED BUILT-UP,AUSTRALIA,245,NONE,S V8 AUTO,AUCKLAND,4-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2005

In [72]:
df = pd.read_csv("../Data/NZ_cars.csv", index_col = ['BODY_TYPE','BASIC_COLOUR'])
df.head(3)

,,OBJECTID,CC_RATING,FIRST_NZ_REGISTRATION_YEAR,FIRST_NZ_REGISTRATION_MONTH,GROSS_VEHICLE_MASS,IMPORT_STATUS,INDUSTRY_CLASS,MAKE,MODEL,MOTIVE_POWER,...,NZ_ASSEMBLED,ORIGINAL_COUNTRY,POWER_RATING,PREVIOUS_COUNTRY,SUBMODEL,TLA,TRANSMISSION_TYPE,VEHICLE_TYPE,VEHICLE_USAGE,VEHICLE_YEAR
BODY_TYPE,BASIC_COLOUR,,,,,,,,,,,,,,,,,,,,,
SALOON,WHITE,3001,1971,1979,5,0,NEW,PRIVATE,PEUGEOT,504,PETROL,...,UNKNOWN,NOT KNOWN,0,NONE,NaN,AUCKLAND,NaN,PASSENGER CAR/VAN,PRIVATE PASSENGER,1979
HATCHBACK,GOLD,3002,1769,2005,5,1245,NEW,PRIVATE,NISSAN,PULSAR,PETROL,...,IMPORTED BUILT-UP,UNITED KINGDOM,92,NONE,1.8 HATCH AUTO,AUCKLAND,5-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2005
SALOON,RED,3003,5665,2005,9,2129,NEW,PRIVATE,HOLDEN,COMMODORE,PETROL,...,IMPORTED BUILT-UP,AUSTRALIA,245,NONE,S V8 AUTO,AUCKLAND,4-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2005

This is called a *hierarchical* index, which we will revisit later in the lecture.

If we have sections of data that we do not wish to import (for example, known bad data), we can populate the `skiprows` argument:

In [74]:
df = pd.read_csv("../Data/NZ_cars.csv",skiprows=[0,1,3])
df.head()

,3002,GOLD,HATCHBACK,1769,2005,5,1245,NEW,PRIVATE,NISSAN,...,IMPORTED BUILT-UP,UNITED KINGDOM,92,NONE,1.8 HATCH AUTO,AUCKLAND,5-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2005.1
0,3004,BLUE,HATCHBACK,1796,2003,10,1690,NEW,PRIVATE,HOLDEN,...,IMPORTED BUILT-UP,GERMANY,85,NONE,CD HATCH 1.8L AUTO,AUCKLAND,4-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2003
1,3005,SILVER,HATCHBACK,1796,2003,6,1640,NEW,PRIVATE,HOLDEN,...,IMPORTED BUILT-UP,GERMANY,85,NONE,CITY HATCH 1.8L MAN,AUCKLAND,5-GEAR MANUAL,PASSENGER CAR/VAN,PRIVATE PASSENGER,2003
2,3006,BLUE,SALOON,1796,2003,7,1690,NEW,PRIVATE,HOLDEN,...,IMPORTED BUILT-UP,GERMANY,85,NONE,CITY SEDAN 1.8L MAN,WHANGANUI DISTRICT,5-GEAR MANUAL,PASSENGER CAR/VAN,PRIVATE PASSENGER,2003
3,3007,SILVER,SALOON,2946,2005,7,0,NEW,PRIVATE,PEUGEOT,...,IMPORTED BUILT-UP,FRANCE,155,NONE,V6 3.0 5DR 6SP A P,NAPIER CITY,6-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2005
4,3008,BLACK,STATION WAGON,1968,2012,4,2185,NEW,PRIVATE,AUDI,...,IMPORTED BUILT-UP,GERMANY,130,NONE,2.0 TDI Q S TRONIC,AUCKLAND,7-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2012

Conversely, if we only want to import a small number of rows from, say, a very large data file we can use `nrows`:

In [76]:
df = pd.read_csv("../Data/NZ_cars.csv",nrows = 4)
df

,OBJECTID,BASIC_COLOUR,BODY_TYPE,CC_RATING,FIRST_NZ_REGISTRATION_YEAR,FIRST_NZ_REGISTRATION_MONTH,GROSS_VEHICLE_MASS,IMPORT_STATUS,INDUSTRY_CLASS,MAKE,...,NZ_ASSEMBLED,ORIGINAL_COUNTRY,POWER_RATING,PREVIOUS_COUNTRY,SUBMODEL,TLA,TRANSMISSION_TYPE,VEHICLE_TYPE,VEHICLE_USAGE,VEHICLE_YEAR
0,3001,WHITE,SALOON,1971,1979,5,0,NEW,PRIVATE,PEUGEOT,...,UNKNOWN,NOT KNOWN,0,NONE,NaN,AUCKLAND,NaN,PASSENGER CAR/VAN,PRIVATE PASSENGER,1979
1,3002,GOLD,HATCHBACK,1769,2005,5,1245,NEW,PRIVATE,NISSAN,...,IMPORTED BUILT-UP,UNITED KINGDOM,92,NONE,1.8 HATCH AUTO,AUCKLAND,5-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2005
2,3003,RED,SALOON,5665,2005,9,2129,NEW,PRIVATE,HOLDEN,...,IMPORTED BUILT-UP,AUSTRALIA,245,NONE,S V8 AUTO,AUCKLAND,4-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2005
3,3004,BLUE,HATCHBACK,1796,2003,10,1690,NEW,PRIVATE,HOLDEN,...,IMPORTED BUILT-UP,GERMANY,85,NONE,CD HATCH 1.8L AUTO,AUCKLAND,4-GEAR AUTO,PASSENGER CAR/VAN,PRIVATE PASSENGER,2003

Most real-world data is incomplete, with values missing due to incomplete observation, data entry or transcription error, or other reasons. Pandas will automatically recognize and parse common missing data indicators, including `NA` and `NULL`.

## 3. Pandas Fundamentals

This section introduces the new user to the key functionality of Pandas that is required to use the software effectively.

For some variety, we will now look at our Electricity generation data in NZ. Try to read the file `generation2.csv` in the Data folder. 

Note that this dataset is larger. It might take a few seconds to a minute of processing time just to read the data

In [78]:
df_gen = pd.read_csv("../Data/generation2.csv", index_col = 'id')
df_gen.head()

,Site_Code,POC_Code,Nwk_Code,Gen_Code,Fuel_Code,Tech_Code,Trading_date,TP1,TP2,TP3,...,TP39,TP40,TP41,TP42,TP43,TP44,TP45,TP46,TP47,TP48
id,,,,,,,,,,,,,,,,,,,,,
0,ARA,ARA2201,MRPL,aratiatia,Hydro,Hydro,1/08/97,29230.0,29100.0,29470.0,...,35320,33900,33790,30310,27580,27110,27200,27310,27330,27260
1,NaN,ARG1101,TRUS,argyle_wairau,Hydro,Hydro,1/08/97,NaN,NaN,NaN,...,3928,3888,3892,908,6,0,0,0,0,0
2,ARI,ARI1101,MRPL,arapuni,Hydro,Hydro,1/08/97,81510.0,81330.0,64800.0,...,83180,83640,76160,72360,63180,62640,62310,63050,63130,54020
3,ATI,ATI2201,MRPL,atiamuri,Hydro,Hydro,1/08/97,19200.0,15270.0,15030.0,...,37420,34650,29350,29650,29670,23190,19910,17830,17930,17550
4,NaN,AVI2201,MERI,aviemore,Hydro,Hydro,1/08/97,87970.0,87880.0,87770.0,...,81980,74380,67190,53040,45970,47080,50350,50870,51740,52350

### 3.1. Manipulating indices

**Reindexing** allows users to manipulate the data labels in a DataFrame. It forces a DataFrame to conform to the new index, and optionally, fill in missing data if requested.

A simple use of `reindex` is to alter the order of the rows:

Notice that we specified the `id` column as the index, since it appears to be a unique identifier. We could try to create a unique index ourselves by combining `Site_Code` and `POC_Code`:

In [80]:
gen_id = df_gen.Site_Code + df_gen.POC_Code.astype(str)
gen_id

id
0       ARAARA2201
1              NaN
2       ARIARI1101
3       ATIATI2201
4              NaN
           ...
1325    TKUTKU2201
1326    TMUTMU1101
1328    WHIWHI2201
1329    WKMWKM2201
1330    WPAWPA2201
Length: 1270, dtype: object

In [81]:
df2 = df_gen.copy()
df2.index = gen_id
df2.head()

,Site_Code,POC_Code,Nwk_Code,Gen_Code,Fuel_Code,Tech_Code,Trading_date,TP1,TP2,TP3,...,TP39,TP40,TP41,TP42,TP43,TP44,TP45,TP46,TP47,TP48
ARAARA2201,ARA,ARA2201,MRPL,aratiatia,Hydro,Hydro,1/08/97,29230.0,29100.0,29470.0,...,35320,33900,33790,30310,27580,27110,27200,27310,27330,27260
NaN,NaN,ARG1101,TRUS,argyle_wairau,Hydro,Hydro,1/08/97,NaN,NaN,NaN,...,3928,3888,3892,908,6,0,0,0,0,0
ARIARI1101,ARI,ARI1101,MRPL,arapuni,Hydro,Hydro,1/08/97,81510.0,81330.0,64800.0,...,83180,83640,76160,72360,63180,62640,62310,63050,63130,54020
ATIATI2201,ATI,ATI2201,MRPL,atiamuri,Hydro,Hydro,1/08/97,19200.0,15270.0,15030.0,...,37420,34650,29350,29650,29670,23190,19910,17830,17930,17550
NaN,NaN,AVI2201,MERI,aviemore,Hydro,Hydro,1/08/97,87970.0,87880.0,87770.0,...,81980,74380,67190,53040,45970,47080,50350,50870,51740,52350

This looks okay, but let's check:

In [83]:
df2.index.is_unique

False

So, indices need not be unique. Our choice is not unique because there are multiple samples with the same `Site_Code` and `POC_Code`

In [85]:
pd.Series(df2.index).value_counts()

HWAHWA1101    31
NPLNPL2201    31
HLYHLY2201    31
OHCOHC2201    31
OHAOHA2201    31
TKUTKU2201    31
CYDCYD2201    31
RPORPO2201    31
COLCOL0661    31
ROTROT1101    31
MTIMTI2201    30
KINKIN0112    30
OHKOHK2201    30
KPOKPO1101    30
WPAWPA2201    30
BENBEN2202    30
ARIARI1101    30
MATMAT1101    30
TMUTMU1101    30
ARAARA2201    30
WKMWKM2201    30
SWNSWN2201    30
TKBTKB2201    30
MANMAN2201    30
WHIWHI2201    30
BWKBWK1101    30
NPLNPL1101    30
ATIATI2201    29
COBCOB0661    29
TKATKA0111    29
SFDSFD2201    29
ROXROX1101    29
MHOMHO0331    29
WRKWRK2201    29
ROXROX2201    29
OHBOHB2201    29
OKIOKI2201    29
PPIPPI2201    29
ARGARG1101    29
OTAOTA2221    28
AVIAVI2201    26
dtype: int64

The most important consequence of a non-unique index is that indexing by label will return multiple values for some labels:

In [87]:
df2.loc['HWAHWA1101']

,Site_Code,POC_Code,Nwk_Code,Gen_Code,Fuel_Code,Tech_Code,Trading_date,TP1,TP2,TP3,...,TP39,TP40,TP41,TP42,TP43,TP44,TP45,TP46,TP47,TP48
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,1/08/97,204.0,204.0,216.0,...,14812,14812,2504,188,192,196,204,204,208,212
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,2/08/97,208.0,208.0,212.0,...,4916,4912,1924,184,196,204,204,212,208,212
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,3/08/97,208.0,212.0,212.0,...,6958,6950,1566,196,196,204,200,192,208,214
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,4/08/97,214.0,212.0,216.0,...,14808,14800,2452,188,192,196,200,204,208,212
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,5/08/97,204.0,208.0,208.0,...,14812,14816,2196,188,192,196,200,200,204,208
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,6/08/97,200.0,208.0,212.0,...,14822,14828,2510,188,188,192,196,204,208,212
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,7/08/97,204.0,212.0,208.0,...,14804,14796,2452,188,188,192,200,208,208,208
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,8/08/97,208.0,212.0,212.0,...,14800,14808,2516,192,196,196,204,204,204,208
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,9/08/97,200.0,208.0,208.0,...,6936,6944,1552,196,200,204,204,208,208,212
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,10/08/97,204.0,208.0,212.0,...,6948,6968,1528,196,196,204,204,204,204,212
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,11/08/97,204.0,212.0,212.0,...,14808,14820,2528,188,200,200,208,208,212,212
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,12/08/97,208.0,208.0,212.0,...,14796,14802,2506,184,192,192,196,204,208,212
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,13/08/97,208.0,208.0,208.0,...,14768,14780,14796,14792,14808,14832,14860,14888,14876,14900
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,14/08/97,14868.0,14876.0,14872.0,...,14940,14932,14944,14964,14948,14964,14984,15008,15004,15032
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,15/08/97,15008.0,14984.0,14976.0,...,14940,14952,14960,14976,14980,14976,14992,15000,15004,15016
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,16/08/97,2564.0,196.0,204.0,...,14924,14944,2156,192,192,196,196,200,200,200
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,17/08/97,196.0,196.0,204.0,...,14928,14924,2464,192,192,200,196,200,208,208
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,18/08/97,204.0,212.0,208.0,...,14906,14908,14920,14934,14942,14946,14944,14968,14978,15010
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,19/08/97,2514.0,196.0,204.0,...,14948,14948,14948,14964,14972,14984,15008,14996,14996,15000
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,20/08/97,2496.0,204.0,204.0,...,14900,14928,14940,14948,14956,14972,14976,15008,15004,15004
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,21/08/97,2516.0,196.0,200.0,...,14944,14940,14932,14944,14956,14972,14976,15000,14980,14988
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,22/08/97,2592.0,196.0,196.0,...,14904,14908,14932,14924,14932,14932,14952,14972,14968,14984
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,23/08/97,15008.0,15004.0,15008.0,...,14930,14938,14932,14942,14964,14984,15008,15020,15012,15016
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,24/08/97,14992.0,15004.0,15004.0,...,4908,4904,1952,180,188,188,192,192,192,196
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,25/08/97,192.0,200.0,204.0,...,14916,14928,2572,180,184,188,192,196,192,200
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,26/08/97,196.0,196.0,200.0,...,14908,14908,14928,14920,14928,14940,14952,14960,14972,14976
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,27/08/97,2596.0,192.0,200.0,...,14932,14932,14936,14956,14940,14940,14968,14972,14980,14980
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,28/08/97,2592.0,192.0,196.0,...,14898,14900,2188,176,176,184,180,184,188,192
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,29/08/97,184.0,192.0,196.0,...,14936,14936,14948,14940,14948,14976,14988,14968,14956,14988
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,30/08/97,5704.0,5244.0,5240.0,...,3692,3700,3712,3720,2916,180,184,188,184,192
HWAHWA1101,HWA,HWA1101,TRUS,patea,Hydro,Hydro,31/08/97,180.0,188.0,188.0,...,176,172,172,180,176,184,188,188,188,184

We will learn more about indexing below.

We can create a truly unique index by combining `POC_Code` and `Trading_date`

In [99]:
new_index = df_gen.POC_Code + df_gen.Trading_date
df3 = df_gen.copy()
df3.index = new_index
df3.head()

,Site_Code,POC_Code,Nwk_Code,Gen_Code,Fuel_Code,Tech_Code,Trading_date,TP1,TP2,TP3,...,TP39,TP40,TP41,TP42,TP43,TP44,TP45,TP46,TP47,TP48
ARA22011/08/97,ARA,ARA2201,MRPL,aratiatia,Hydro,Hydro,1/08/97,29230.0,29100.0,29470.0,...,35320,33900,33790,30310,27580,27110,27200,27310,27330,27260
ARG11011/08/97,NaN,ARG1101,TRUS,argyle_wairau,Hydro,Hydro,1/08/97,NaN,NaN,NaN,...,3928,3888,3892,908,6,0,0,0,0,0
ARI11011/08/97,ARI,ARI1101,MRPL,arapuni,Hydro,Hydro,1/08/97,81510.0,81330.0,64800.0,...,83180,83640,76160,72360,63180,62640,62310,63050,63130,54020
ATI22011/08/97,ATI,ATI2201,MRPL,atiamuri,Hydro,Hydro,1/08/97,19200.0,15270.0,15030.0,...,37420,34650,29350,29650,29670,23190,19910,17830,17930,17550
AVI22011/08/97,NaN,AVI2201,MERI,aviemore,Hydro,Hydro,1/08/97,87970.0,87880.0,87770.0,...,81980,74380,67190,53040,45970,47080,50350,50870,51740,52350

In [89]:
df3.index.is_unique

True

In [90]:
df3.loc['ARG11011/08/97']

Site_Code                 NaN
POC_Code              ARG1101
Nwk_Code                 TRUS
Gen_Code        argyle_wairau
Fuel_Code               Hydro
Tech_Code               Hydro
Trading_date          1/08/97
TP1                       NaN
TP2                       NaN
TP3                       NaN
TP4                         0
TP5                         0
TP6                       NaN
TP7                       NaN
TP8                       NaN
TP9                         0
TP10                      NaN
TP11                      NaN
TP12                        0
TP13                        0
TP14                        0
TP15                        0
TP16                        0
TP17                     2349
TP18                     3354
TP19                     3363
TP20                     3375
TP21                     3374
TP22                     3378
TP23                     3378
TP24                     1443
TP25                       18
TP26                        0
TP27                        0
TP28                        0
TP29                        0
TP30                        0
TP31                        0
TP32                        0
TP33                     3978
TP34                     4510
TP35                     4216
TP36                     4064
TP37                     3972
TP38                     3942
TP39                     3928
TP40                     3888
TP41                     3892
TP42                      908
TP43                        6
TP44                        0
TP45                        0
TP46                        0
TP47                        0
TP48                        0
Name: ARG11011/08/97, dtype: object

and you may ask why do we need a truly unique index? 

![alt_text](https://i.stack.imgur.com/1ejWY.png)

You may notice the missing values where Pandas has read them as `NaN`
Missing values can be filled as desired, either with selected values, or by rule:

In [102]:
df3['Site_Code'] = df3['Site_Code'].fillna("Unknown_Site_Code")
df3['TP1'].sum()

56054684.0

And we can replace the rest of `NaN` with zeros

In [100]:
df3 = df3.fillna(method='backfill')
display(df3)

,Site_Code,POC_Code,Nwk_Code,Gen_Code,Fuel_Code,Tech_Code,Trading_date,TP1,TP2,TP3,...,TP39,TP40,TP41,TP42,TP43,TP44,TP45,TP46,TP47,TP48
ARA22011/08/97,ARA,ARA2201,MRPL,aratiatia,Hydro,Hydro,1/08/97,29230.0,29100.0,29470.0,...,35320,33900,33790,30310,27580,27110,27200,27310,27330,27260
ARG11011/08/97,ARI,ARG1101,TRUS,argyle_wairau,Hydro,Hydro,1/08/97,81510.0,81330.0,64800.0,...,3928,3888,3892,908,6,0,0,0,0,0
ARI11011/08/97,ARI,ARI1101,MRPL,arapuni,Hydro,Hydro,1/08/97,81510.0,81330.0,64800.0,...,83180,83640,76160,72360,63180,62640,62310,63050,63130,54020
ATI22011/08/97,ATI,ATI2201,MRPL,atiamuri,Hydro,Hydro,1/08/97,19200.0,15270.0,15030.0,...,37420,34650,29350,29650,29670,23190,19910,17830,17930,17550
AVI22011/08/97,BEN,AVI2201,MERI,aviemore,Hydro,Hydro,1/08/97,87970.0,87880.0,87770.0,...,81980,74380,67190,53040,45970,47080,50350,50870,51740,52350
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
TKU220131/08/97,TKU,TKU2201,GENE,tokaanu,Hydro,Hydro,31/08/97,0.0,0.0,0.0,...,100960,101940,100950,95440,90370,38630,11240,8820,4200,2430
TMU110131/08/97,TMU,TMU1101,GENE,te_awamutu,Gas,Cogen,31/08/97,11740.0,12550.0,11620.0,...,11970,12270,12240,13170,13700,13790,13800,12060,11870,12200
WHI220131/08/97,WHI,WHI2201,CTCT,whirinaki,Diesel,Thrml,31/08/97,0.0,0.0,0.0,...,0,0,0,0,0,0,0,0,0,0
WKM220131/08/97,WKM,WKM2201,MRPL,whakamaru,Hydro,Hydro,31/08/97,15940.0,15120.0,15160.0,...,46350,46820,46470,46460,46600,46740,45450,26870,23950,23870
WPA220131/08/97,WPA,WPA2201,MRPL,waipapa,Hydro,Hydro,31/08/97,10770.0,9080.0,9090.0,...,18180,23130,23390,21250,16390,16630,18430,12250,15790,9180

Keep in mind that `reindex` does not work if we pass a non-unique index series.

We can remove rows or columns via the `drop` method:

In [95]:
df3=df3.drop(['TP1'],axis=1)
df3.head()

,Site_Code,POC_Code,Nwk_Code,Gen_Code,Fuel_Code,Tech_Code,Trading_date,TP2,TP3,TP4,...,TP39,TP40,TP41,TP42,TP43,TP44,TP45,TP46,TP47,TP48
ARA22011/08/97,ARA,ARA2201,MRPL,aratiatia,Hydro,Hydro,1/08/97,29100.0,29470.0,29690.0,...,35320,33900,33790,30310,27580,27110,27200,27310,27330,27260
ARG11011/08/97,Unknown_Site_Code,ARG1101,TRUS,argyle_wairau,Hydro,Hydro,1/08/97,0.0,0.0,0.0,...,3928,3888,3892,908,6,0,0,0,0,0
ARI11011/08/97,ARI,ARI1101,MRPL,arapuni,Hydro,Hydro,1/08/97,81330.0,64800.0,61780.0,...,83180,83640,76160,72360,63180,62640,62310,63050,63130,54020
ATI22011/08/97,ATI,ATI2201,MRPL,atiamuri,Hydro,Hydro,1/08/97,15270.0,15030.0,15070.0,...,37420,34650,29350,29650,29670,23190,19910,17830,17930,17550
AVI22011/08/97,Unknown_Site_Code,AVI2201,MERI,aviemore,Hydro,Hydro,1/08/97,87880.0,87770.0,72830.0,...,81980,74380,67190,53040,45970,47080,50350,50870,51740,52350

### 3.2 Data Selection

This section discusses methods to select data from Pandas dataframe. First, let's create a series named `Fuel` with all the Fuel_Code

In [109]:
fuel = df3['Fuel_Code'].unique()

Now let's choose the first three items in the Series

In [113]:
fuel[0:3]

0    Hydro
1     Coal
2     Wood
dtype: object

Then let's choose specific values from one index to another

We can slice with data labels, since they have an intrinsic order within the Index:

With this we can also modify the data, let's force all the data selected to 'Solar'

In a `DataFrame` we can slice along either or both axes. Let's select a smaller Dataframe of `Fuel_Code` and `Tech_Code`

We notice that there are data points where 'TP1' is zero, so let's filter them out. Note that we have to assign the value to itself or to another data frame.

Using the labels, we can use indexing field `loc` to select subsets of rows and columns in an intuitive way:

We can choose multiple rows and columns, too

What's if we want to select columns and rows with the numeric position of their rows and columns ?

We use `iloc` instead

And what's if we want a mix between the string label and the numeric values?

We can use `groupby` to select data of specific conditions

For instance, let's select al generators of different types ('Diesel', 'Hydro' and 'Solar') and then calculate the mean, minimum and maximum of `TP1`

`Groupby` can also be applied with multiple conditions

### 3.3 Data Operations

`DataFrame` and `Series` objects allow for several operations to take place either on a single object, or between two or more objects.

For example, we can perform arithmetic on the elements of two objects, such as combining baseball statistics across years:

We see a lot of `NaN` because Pandas' data alignment places `NaN` values for labels that do not overlap in the two Series. In fact, there are only 264 sites that have both `Hydro` and `Thrml`

While we do want the operation to honor the data labels in this way, we probably do not want the missing values to be filled with `NaN`. We can use the `add` method to calculate `TP1` totals by using the `fill_value` argument to insert a zero where labels do not overlap:

Operations can also be **broadcast** between rows or columns.

For example, if we subtract the maximum `TP1` value from the `hr` column, we get how many fewer than the maximum were by each site:

Or, looking at things row-wise, we can see how a particular site compares with the rest of the group with respect to important statistics. Let's look at site 1000 and see how is it diffeerent to the rest in terms of TP1 to TP4

We can also apply functions to each column or row of a `DataFrame`. Let's see the median of TP1 to TP4

If we need to do more complicated calculations that Pandas does not natively support, 
a trick to use is to develop a `lambda` function that can be applied accross the dataframe

For instance here we want to know the different between the maximum and minimum values of `TP1` to `TP4`

Lets use apply to calcuate a weighted sum of values. This also an example of how we can write equations in Markdown

$$SLG = \frac{TP1 + (2 \times TP2) + (3 \times TP3) + (4 \times TP4)}{TP1+TP2+TP3+TP4+100}$$

### 3.4 Sorting and Ranking

Pandas objects include methods for re-ordering data. First, let's try to sort the index of our dataframe

What if we want to sort the columns instead?

And we can also sort values instead of sorting the index

For a `DataFrame`, we can sort according to the values of one or more columns using the `by` argument of `sort_values`:

**Ranking** does not re-arrange data, but instead returns an index that ranks each value relative to others in the Series. Let's rank the generators according to their `TP1` values

Ties are assigned the mean value of the tied ranks, which may result in decimal values.

Alternatively, you can break ties via one of several methods, such as by the order in which they occur in the dataset:

When multiple columns are selected, the rank for each column will be returned

### Exercise

Calculate another  **weighted sum** of each generator in `df_gen_unique`, and return the ordered series of estimates.

$$eq2 = \frac{TP3 + TP5^2 - 5*TP7}{TP9 - 4*TP11 + TP13 + 200}$$

In [ ]:
# Write your answer here

### 3.5 Hierarchical indexing

In the electricity generation example, we combined 2 fields to obtain a unique index that was not simply an integer value. A more elegant way to have done this would be to create a hierarchical index from the three fields.

This index is a `MultiIndex` object that consists of a sequence of tuples, the elements of which is some combination of the two columns used to create the index. Where there are multiple repeated values, Pandas does not print the repeats, making it easy to identify groups of values.

Multi-indexing can be done when we read CSV data, too

With a hierachical index, we can select subsets of the data based on a *partial* index:

Hierarchical indices can be created on either or both axes. Here is a trivial example:

If you want to get fancy, both the row and column indices themselves can be given names:

With this, we can do all sorts of custom indexing:

Additionally, the order of the set of indices in a hierarchical `MultiIndex` can be changed by swapping them pairwise:

### 3.6 Missing data

The occurence of missing data is so prevalent that it pays to use tools like Pandas, which seamlessly integrates missing data handling so that it can be dealt with easily, and in the manner required by the analysis at hand.

Missing data are represented in `Series` and `DataFrame` objects by the `NaN` floating point value. However, `None` is also treated as missing, since it is commonly used as such in other contexts (*e.g.* NumPy).

Missing values may be dropped or indexed out:

By default, `dropna` drops entire rows in which one or more values are missing.

This can be overridden by passing the `how='all'` argument, which only drops a row when every field is a missing value.

This can be customized further by specifying how many values need to be present before a row is dropped via the `thresh` argument.

If we want to drop missing values column-wise instead of row-wise, we use `axis=1`.

Rather than omitting missing data from an analysis, in some cases it may be suitable to fill the missing value in, either with a default value (such as zero) or a value that is either imputed or carried forward/backward from similar data points. We can do this programmatically in Pandas with the `fillna` argument. First, let's fill all missing value with zeros

We can specify condition in each column to fill missing values

Notice that `fillna` by default returns a new object with the desired filling behavior, rather than changing the `Series` or  `DataFrame` in place (**in general, we like to do this, by the way!**).

We can alter values in-place using `inplace=True`.

Missing values can also be interpolated, using any one of a variety of methods: 
Read more here: https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.fillna.html

### 3.7 Data summarization

We often wish to summarize data in `Series` or `DataFrame` objects, so that they can more easily be understood or compared with similar data. The Pandas package contains several functions that are useful here, but several summarization or reduction methods are built into Pandas data structures.

A useful summarization that gives a quick snapshot of multiple statistics for a `Series` or `DataFrame` is `describe`:

`describe` can detect non-numeric data and sometimes yield useful information about it.

We can also calculate summary statistics *across* multiple columns, for example, correlation and covariance.

$$cov(x,y) = \sum_i (x_i - \bar{x})(y_i - \bar{y})$$

$$corr(x,y) = \frac{cov(x,y)}{(n-1)s_x s_y} = \frac{\sum_i (x_i - \bar{x})(y_i - \bar{y})}{\sqrt{\sum_i (x_i - \bar{x})^2 \sum_i (y_i - \bar{y})^2}}$$

A simple function can give us the whole correlation table

If we have a `DataFrame` with a hierarchical index (or indices), summary statistics can be applied with respect to any of the index levels:

### 3.8 Merging and appending data

Sometimes we have to merge data together. Pandas also supports this operation

First, we slide data to take two Dataframes for `Coal` and `Hydro` only

now combine `df1` and `df2`

### 3.9 Writing Data to Files

As well as being able to read several data input formats, Pandas can also export data to a variety of storage formats. We will bring your attention to just a couple of these.

First we do a simple export to csv file to the same folder our code is in

The `to_csv` method writes a `DataFrame` to a comma-separated values (csv) file. You can specify custom delimiters (via `sep` argument), how missing values are written (via `na_rep` argument), whether the index is writen (via `index` argument), whether the header is included (via `header` argument), among other options.

An efficient way of storing data to disk is in binary format. Pandas supports this using Pythonâ€™s built-in pickle serialization.

The complement to `to_pickle` is the `read_pickle` function, which restores the pickle to a `DataFrame` or `Series`: